def main():
    """
    Ввод значений с клавиатуры для формирования списка,
    по которому мы ищем искомое число и искомого числа
    (опционально) предложить пользователю сформировать список вручную с клавиатуры

    __ вызов функции guess_number с параметрами: __
        - искомое число (target)
        - список, по которому идем
        - тип поиска (последовательный, или бинарный)

    __вывод результатов на экран__
    """
    lst: list
    if bool(input("Хотите весь массив написать самостоятельно, или только границы? 1/0 соответсвенно\n")):
        lst = [x for x in range(int(input("Левая граница")), int(input("Правая граница")))]
    else:
        lst = map(str())
    target = int(input("Введите искомое число\n"))


    pass


