def main():
    """
    Ввод значений с клавиатуры для формирования списка,
    по которому мы ищем искомое число и искомого числа
    (опционально) предложить пользователю сформировать список вручную с клаиватуры

    __ вызов функции guess_number с параметрами: __
        - искомое число (target)
        - список, по которому идем
        - тип поиска (последовательный, или бинарный)

    __вывод результатов на экран__
    :return:
    """
    pass


def guess_number(target, lst, type='seq') -> list[int, int | None]:
    if type == 'seq':
        # ищем число последовательно
        pass
    elif type == 'bin':
        # ищем число с помощью бин поиска
        pass

    pass
